<script setup>
import { useRoute } from 'vue-router';
import { ref } from 'vue';

const route = useRoute();
const no = route.params.no;  // URL에서 공지 ID를 가져옴
const article = ref({});

// Mock 데이터
const mockData = [
  { id: 1, title: '공지 1', content: '안녕하세요.뉴집스 운영팀입니다. 항상 뉴집스을 이용해주시는 파트너 공인중개사분들께 감사드리며, 새로운 개인정보 처리방침 시행에 관한 안내 말씀드립니다. 새롭게 바뀌는 개인정보 처리방침 변경사항을 확인하시어 서비스 이용에 참고해 주시기 바랍니다.'},
  { id: 2, title: '공지 2', content: '안녕하세요.뉴집스 운영팀입니다. 항상 뉴집스을 이용해주시는 파트너 공인중개사분들께 감사드리며, 새로운 개인정보 처리방침 시행에 관한 안내 말씀드립니다. 새롭게 바뀌는 개인정보 처리방침 변경사항을 확인하시어 서비스 이용에 참고해 주시기 바랍니다.'},
  { id: 3, title: '공지 3', content: '안녕하세요.뉴집스 운영팀입니다. 항상 뉴집스을 이용해주시는 파트너 공인중개사분들께 감사드리며, 새로운 개인정보 처리방침 시행에 관한 안내 말씀드립니다. 새롭게 바뀌는 개인정보 처리방침 변경사항을 확인하시어 서비스 이용에 참고해 주시기 바랍니다.'},
  { id: 4, title: '공지 4', content: '안녕하세요.뉴집스 운영팀입니다. 항상 뉴집스을 이용해주시는 파트너 공인중개사분들께 감사드리며, 새로운 개인정보 처리방침 시행에 관한 안내 말씀드립니다. 새롭게 바뀌는 개인정보 처리방침 변경사항을 확인하시어 서비스 이용에 참고해 주시기 바랍니다.'},
  { id: 5, title: '공지 5', content:  '안녕하세요.뉴집스 운영팀입니다. 항상 뉴집스을 이용해주시는 파트너 공인중개사분들께 감사드리며, 새로운 개인정보 처리방침 시행에 관한 안내 말씀드립니다. 새롭게 바뀌는 개인정보 처리방침 변경사항을 확인하시어 서비스 이용에 참고해 주시기 바랍니다.'},
  { id: 6, title: '공지 6', content:  '안녕하세요.뉴집스 운영팀입니다. 항상 뉴집스을 이용해주시는 파트너 공인중개사분들께 감사드리며, 새로운 개인정보 처리방침 시행에 관한 안내 말씀드립니다. 새롭게 바뀌는 개인정보 처리방침 변경사항을 확인하시어 서비스 이용에 참고해 주시기 바랍니다.'},
  { id: 7, title: '공지 7', content:  '안녕하세요.뉴집스 운영팀입니다. 항상 뉴집스을 이용해주시는 파트너 공인중개사분들께 감사드리며, 새로운 개인정보 처리방침 시행에 관한 안내 말씀드립니다. 새롭게 바뀌는 개인정보 처리방침 변경사항을 확인하시어 서비스 이용에 참고해 주시기 바랍니다.'},
  { id: 8, title: '공지 8', content:  '안녕하세요.뉴집스 운영팀입니다. 항상 뉴집스을 이용해주시는 파트너 공인중개사분들께 감사드리며, 새로운 개인정보 처리방침 시행에 관한 안내 말씀드립니다. 새롭게 바뀌는 개인정보 처리방침 변경사항을 확인하시어 서비스 이용에 참고해 주시기 바랍니다.'},
  { id: 9, title: '공지 9', content:  '안녕하세요.뉴집스 운영팀입니다. 항상 뉴집스을 이용해주시는 파트너 공인중개사분들께 감사드리며, 새로운 개인정보 처리방침 시행에 관한 안내 말씀드립니다. 새롭게 바뀌는 개인정보 처리방침 변경사항을 확인하시어 서비스 이용에 참고해 주시기 바랍니다.'},
  { id: 10, title: '공지 10',content: '안녕하세요.뉴집스 운영팀입니다. 항상 뉴집스을 이용해주시는 파트너 공인중개사분들께 감사드리며, 새로운 개인정보 처리방침 시행에 관한 안내 말씀드립니다. 새롭게 바뀌는 개인정보 처리방침 변경사항을 확인하시어 서비스 이용에 참고해 주시기 바랍니다.'},
  { id: 11, title: '공지 11',content: '안녕하세요.뉴집스 운영팀입니다. 항상 뉴집스을 이용해주시는 파트너 공인중개사분들께 감사드리며, 새로운 개인정보 처리방침 시행에 관한 안내 말씀드립니다. 새롭게 바뀌는 개인정보 처리방침 변경사항을 확인하시어 서비스 이용에 참고해 주시기 바랍니다.'},
  { id: 12, title: '공지 12',content: '안녕하세요.뉴집스 운영팀입니다. 항상 뉴집스을 이용해주시는 파트너 공인중개사분들께 감사드리며, 새로운 개인정보 처리방침 시행에 관한 안내 말씀드립니다. 새롭게 바뀌는 개인정보 처리방침 변경사항을 확인하시어 서비스 이용에 참고해 주시기 바랍니다.'},
  { id: 13, title: '공지 13',content: '안녕하세요.뉴집스 운영팀입니다. 항상 뉴집스을 이용해주시는 파트너 공인중개사분들께 감사드리며, 새로운 개인정보 처리방침 시행에 관한 안내 말씀드립니다. 새롭게 바뀌는 개인정보 처리방침 변경사항을 확인하시어 서비스 이용에 참고해 주시기 바랍니다.'},
  { id: 14, title: '공지 14',content: '안녕하세요.뉴집스 운영팀입니다. 항상 뉴집스을 이용해주시는 파트너 공인중개사분들께 감사드리며, 새로운 개인정보 처리방침 시행에 관한 안내 말씀드립니다. 새롭게 바뀌는 개인정보 처리방침 변경사항을 확인하시어 서비스 이용에 참고해 주시기 바랍니다.'},
  { id: 15, title: '공지 15',content: '안녕하세요.뉴집스 운영팀입니다. 항상 뉴집스을 이용해주시는 파트너 공인중개사분들께 감사드리며, 새로운 개인정보 처리방침 시행에 관한 안내 말씀드립니다. 새롭게 바뀌는 개인정보 처리방침 변경사항을 확인하시어 서비스 이용에 참고해 주시기 바랍니다.'},
  { id: 16, title: '공지 16',content: '안녕하세요.뉴집스 운영팀입니다. 항상 뉴집스을 이용해주시는 파트너 공인중개사분들께 감사드리며, 새로운 개인정보 처리방침 시행에 관한 안내 말씀드립니다. 새롭게 바뀌는 개인정보 처리방침 변경사항을 확인하시어 서비스 이용에 참고해 주시기 바랍니다.'},
  { id: 17, title: '공지 17',content: '안녕하세요.뉴집스 운영팀입니다. 항상 뉴집스을 이용해주시는 파트너 공인중개사분들께 감사드리며, 새로운 개인정보 처리방침 시행에 관한 안내 말씀드립니다. 새롭게 바뀌는 개인정보 처리방침 변경사항을 확인하시어 서비스 이용에 참고해 주시기 바랍니다.'},
  { id: 18, title: '공지 18',content: '안녕하세요.뉴집스 운영팀입니다. 항상 뉴집스을 이용해주시는 파트너 공인중개사분들께 감사드리며, 새로운 개인정보 처리방침 시행에 관한 안내 말씀드립니다. 새롭게 바뀌는 개인정보 처리방침 변경사항을 확인하시어 서비스 이용에 참고해 주시기 바랍니다.'},
];

// 공지사항 찾기
const fetchArticle = () => {
  article.value = mockData.find(item => item.id == no);
};

fetchArticle();
</script>

<template>
  <div class="notice-header-wrapper">
    <div class="notice-header">
      <h1 class="mb-3">공지 사항</h1>
      <div class="form-label">새로운 소식과 공지를 확인하세요!</div>
    </div>
  </div>

  <div class="container mt-5 mb-md-4 py-5">
    <!-- 공지 제목과 메타 정보 -->
    <h1 class="h2 mb-4">{{ article.title }}</h1>
    <div class="mb-4 pb-1">
      <ul class="list-unstyled d-flex flex-wrap mb-0 text-nowrap">
        <li class="me-3"><i class="fi-calendar-alt me-2 mt-n1 opacity-60"></i>Mar 18</li>
      </ul>
    </div>
    <!-- 공지 내용 -->
    <div class="mb-4 pb-md-3"><img class="rounded-3" src="https://image.ajunews.com/content/image/2022/04/04/20220404181310254680.jpg" alt="Post image"></div>
    <div class="row">
      <div class="col-lg-12 col-md-12">
        <h6>{{ article.content }}</h6>
        <h4>[주요 개정 사항]</h4>
        <h5>뉴집스 개인정보 처리방침(이하 ‘처리방침’이라 한다.)</h5>
        <p>주요 개정사항은 아래와 같습니다.</p>
        <p>1)「정보통신망 이용촉진 및 정보보호 등에 관한 법률」및「개인정보 보호법」개정 내용 반영
          개인정보보호 관련 주요 법령 및 고시에 의거하여 처리방침 내 신규 조항 마련 및 기조항의 내용을
          보강하여 개정
          ‘제5조 정보주체의 권리∙의무 및 행사방법’, ‘제8조 개인정보의 안전성 확보조치’, ‘제11조 개인정보 열람청구’, ‘제12조권익침해 구제방법’</p>
        <p>
          2)개인정보파일 운용 현황 최신화
          개인정보의 ‘처리 목적’, ‘보유기간’, ‘처리항목’ 등 운용 현황 업데이트
        </p>
        <p>3)(아무소리)(아무소리)(아무소리)「정보통신망 이용촉진 및 정보보호 등에 관한 법률」및「개인정보 보호법」개정 내용 반영
          개인정보보호 관련 주요 법령 및 고시에 의거하여 처리방침 내 신규 조항 마련 및 기조항의 내용을
          보강하여 개정
          ‘제5조 정보주체의 권리∙의무 및 행사방법’, ‘제8조 개인정보의 안전성 확보조치’, ‘제11조 개인정보 열람청구’, ‘제12조권익침해 구제방법’</p>

        <p>4)(아무소리)(아무소리)(아무소리)(아무소리)개인정보파일 운용 현황 최신화
          개인정보의 ‘처리 목적’, ‘보유기간’, ‘처리항목’ 등 운용 현황 업데이트
        </p>

        <p>5)(아무소리)(아무소리)(아무소리)(아무소리)「정보통신망 이용촉진 및 정보보호 등에 관한 법률」및「개인정보 보호법」개정 내용 반영
          개인정보보호 관련 주요 법령 및 고시에 의거하여 처리방침 내 신규 조항 마련 및 기조항의 내용을
          보강하여 개정
          ‘제5조 정보주체의 권리∙의무 및 행사방법’, ‘제8조 개인정보의 안전성 확보조치’, ‘제11조 개인정보 열람청구’, ‘제12조권익침해 구제방법’</p>

      </div>
    </div>
  </div>
</template>

<style scoped>
.notice-header-wrapper {
  background-color: #F5F6F7;
  width: 100vw;
  margin-left: calc(-50vw + 50%);
  margin-right: calc(-50vw + 50%);
  padding: 40px;
}
</style>
